{
  "blog": [
    {
      "title": "A Quantum Achievement: But it’s Just the Beginning",
      "author": "jatin",
      "logo": "https://cdn-images-1.medium.com/max/1200/1*mw6Md1N8jN24QXBWCZx8zw.png",
      "category": "Technology",
      "content": "We wanted Firefox to be faster. Much faster. But it’s not enough to just be fast — our goal was to make an overall better browser for the user. Why have all that speed if you’re not going to put it where the user wants it most?\nI first shared our vision for “Project Quantum” last year. That’s the code name we used for our work to embrace a truly next generation architecture for Firefox, and for the web. Here we are one year later and today we celebrate the release of a new Firefox, the most powerful version of Firefox yet. Anyone who downloads this version, which is so advanced we call it “Firefox Quantum,” simply can’t help but notice the speed, performance improvements and the responsively slick new UI.\nFirefox Quantum is the best browser for today’s modern consumers because we used only the best of the latest technology to build it. It’s fast because if you look under the hood, you’ll see each layer was crafted from the bottom up with performance goals at the center.\nAs Mark Mayo explained, Firefox Quantum is not only the fastest yet, it keeps you safe from unwanted targeting with the Private Browsing mode. This is quite the achievement from the only major browser on the market backed by a not-for-profit company. We’ve revitalized Firefox to be the perfect browser for the casual user or the developer who needs modern tools and maximum performance for their work.\nAnd though today’s new Firefox represents an extraordinary advance in responsiveness, Firefox Quantum isn’t the end of our efforts. Rather, it’s just the start of a new era of Firefox.\nWe Called it Quantum\nThe central advancement for Project Quantum was parallelism, the benefits of which we’d seen with Servo, our high-performance browser engine project. The clear throughput and performance advantages of Servo convinced us we could create a new web rendering engine for Firefox with unprecedented security and responsiveness.\nServo unlocks your machine to give you the best web experience using modern techniques to take full advantage of today’s hardware. A large part of that is because we built it leveraging Rust, a safe and fast programming language pioneered at Mozilla to do a better job utilizing today’s multi-core processors. With Rust you get speed, memory safety and parallelism under its aptly true tagline of “Fearless Concurrency.”\nA global team of engineers came together with one goal in mind — handcraft a rendering engine that can deliver all components of a web page in parallel on multiple CPU threads. As part of that we’ve had the added benefit of thousands of community members contributing to both Rust and Servo.\nProjects like Servo and Rust are just some of the innovations we are working on inside Mozilla’s Emerging Technology group. As you may recall from our Project Quantum posts last year, we not only talked about building a transformatively better engine for Firefox but also our commitment to make those core technologies reusable inside other projects and applications, enabling an extraordinary range of user experiences and platforms well beyond today’s web.\nWe’re Not Done Yet\nFirefox Quantum is an amazing step forward in part due to incorporation of breakthrough technologies from Servo, but it is only the beginning of the Project Quantum journey. Already you can find additional new components from Servo in Firefox Nightly such as WebRender — a recasting of the browser graphics rendering pipeline designed to take advantage of high-performance techniques perfected in state-of-the-art video games. Developers might be happy to know you can also see these latest updates to Quantum in Developer Edition.\nWe have our eye on other work in Servo and in Mozilla’s Emerging Technologies group as part of that future too. Ideas currently being explored further along the Project Quantum path include ways to apply insights on parallelization to other areas that will give users a delightful increase in responsiveness, such as prioritizing just those pages they’re interacting with, or the way the browser lays out a page.\nWe’re also coming back to embedding, a topic we highlighted last year, as we see opportunities to craft a diverse set of application experiences around our next-generation components. Those aren’t confined to rendering traditional 2D web content either, as we have for example demonstrated how Servo can enable a new class of 3D environments and power “mixed reality” head-mounted displays. And we’re curious how far we can extend the benefits of WebAssembly to bring both more developers and more assets to the web, leveraging a powerful new virtual machine at the heart of every browser.\nAt Mozilla we’re delighted at the progress we’ve made over the past year in bringing Firefox Quantum to fruition and we’re sure you’ll enjoy it too. We have much more magic up our sleeve, and hope you’ll continue to follow along with us as we strive to make the web work for good.",
      "date": "Fri Nov 17 2017",
      "id": "KmuupPx"
    },
    {
      "title": "10 Best Practices for Better RESTful API",
      "author": "jatin",
      "logo": "https://blog.mwaysolutions.com/wp-content/uploads/2014/06/20140602_restful_api_checklist_img.jpg",
      "category": "Technology",
      "content": "Web APIs has become an very important topic in the last year. We at M-Way Solutions are working every day with different backend systems and therefore we know about the importance of a clean API design.\n\n\nTypically we use a RESTful design for our web APIs. The concept of REST is to separate the API structure into logical resources. There are used the HTTP methods GET, DELETE, POST and PUT to operate with the resources.\n\nThese are 10 best practices to design a clean RESTful API:\n\n1. Use nouns but no verbs\n\nFor an easy understanding use this structure for every resource:\n\nResource\tGET\nread\tPOST\ncreate\tPUT\nupdate\tDELETE\n/cars\tReturns a list of cars\tCreate a new car\tBulk update of cars\tDelete all cars\n/cars/711\tReturns a specific car\tMethod not allowed (405)\tUpdates a specific car\tDeletes a specific car\nDo not use verbs:\n\n/getAllCars\n/createNewCar\n/deleteAllRedCars\n2. GET method and query parameters should not alter the state\n\nUse PUT, POST and DELETE methods  instead of the GET method to alter the state.\nDo not use GET for state changes:\n\nGET /users/711?activate or\nGET /users/711/activate\n \n\n3. Use plural nouns\n\nDo not mix up singular and plural nouns. Keep it simple and use only plural nouns for all resources.\n\n/cars instead of /car\n/users instead of /user\n/products instead of /product\n/settings instead of /setting\n\n4. Use sub-resources for relations\n\nIf a resource is related to another resource use subresources.\n\nGET /cars/711/drivers/ Returns a list of drivers for car 711\nGET /cars/711/drivers/4 Returns driver #4 for car 711",
      "date": "Fri Nov 17 2017",
      "id": "dXogrnK"
    },
    {
      "title": "The 12 New Rules to Become Radically Successful as An Artist",
      "author": "jatin",
      "logo": "https://cdn-images-1.medium.com/max/1500/1*mZQwWtY9HtaZ2ZLIifs2Jw.jpeg",
      "category": "Creativity",
      "content": "The greater danger for most of us lies not in setting our aim too high and falling short; but in setting our aim too low, and achieving our mark. — Michelangelo Buonarotti\nIn 1995, an American professor made an unusual discovery. At Syracuse University in Florence, Rab Hatfield was trying to match the scenes of the Sistine Chapel to the dates Michelangelo had painted each of them.\nSince the artist had received commissions in various installments, the professor thought there might be a paper trail, so he went to the city archives. Surprised at how easy it was to locate five-hundred-year-old bank records, he began reconstructing a more accurate timeline for how the most famous ceiling in the world came to be.\nThat’s when he saw it.\n“I was really looking for something else!” the professor yelled into the phone from his office in Italy, decades later. “Every time I run across something, it’s because I was looking for something else, which I consider real discovery. It’s when you don’t expect it that you really discover something.”\nWith a PhD from Harvard, Professor Hatfield had begun his career at Yale in 1966 before moving to Syracuse University in 1971, and in all that time of teaching art history, he had never encountered anything like this.\nWhat he found in those records was not what you would expect to find digging around in the bank account of an artist, even one whose fame would grow with each passing century.\n“I don’t know how much you know about Michelangelo,” he told me, “but usually they taught us that he kind of struggled like Vincent van Gogh.”\nFor centuries, this is what historians believed about the great Renaissance master. He was just another Starving Artist, struggling to make ends meet. Michelangelo himself embraced this image, living frugally and often complaining about money. He once wrote in a poem that his art had left him “poor, old and working as a servant of others.”\nBut it turns out he wasn’t telling the truth.\nWhen Rab Hatfield dug into those old bank records, the truth about the Renaissance’s most famous artist was finally revealed. He was not struggling at all. He was not poor, and he was not starving for his art — a fact we have been getting wrong ever since.\nMichelangelo was, in fact, very rich. One record Professor Hatfield found showed a balance of hundreds of thousands of dollars, which was a rare sum of money for an artist at the time. When he saw those figures, the professor forgot all about the Sistine Chapel.\nWith his curiosity piqued, he went to see if there were more bank records, and there were more — many more. In the end, he uncovered a fortune worth roughly $47 million today, making Michelangelo the richest artist of the Renaissance.\nAnd to this day, this is a story that surprises us.\nWhy?\nWe are accustomed to a certain narrative about artists, one that indicates they are barely getting by. But Michelangelo did not suffer or starve for his work. He was a multimillionaire and successful entrepreneur, a “pivotal figure in the transition of creative geniuses from people regarded, and paid, as craftsmen to people accorded a different level of treatment and compensation,” in the words of journalist Frank Bruni.\nIn other words, the master sculptor and painter wasn’t just some art school dropout struggling for his art. He was a rainmaker.\nWhen I asked Professor Hatfield what Michelangelo’s millions mean for us today, he said, “I don’t think it means a whole lot.” But I disagree. I think this changes everything.\nMyth of the starving artist\nTwo hundred years after Michelangelo died, Henri Murger was born the son of a tailor and concierge in France. Living in Paris, he was surrounded by creative geniuses and dreamed of joining them, but he grew frustrated with his failure to find financial security.\nIn 1847, Murger published Scènes de la vie de bohème, a collection of stories that playfully romanticized poverty. The result was some literary acclaim, persistent struggle, and an untimely end to a penniless life.\nThe book limped along after the author’s death, being adapted first as the opera La Bohème and later as a film, eventually achieving widespread acclaim with spinoffs including Rent and Moulin Rouge.\nMurger’s Scènes launched the concept of the Starving Artist into the public’s understanding as the model for a creative life. To this day, it endures as the model for what we imagine we think of the word artist.\nThe story of the Starving Artist overshadows the quiet, relatively unknown tale of Michelangelo’s success and has become our most popular understanding of what’s possible for creative people — which is to say, not much.\nToday, we find the remnants of this story nearly everywhere we look. It is the advice we give a friend who dreams of painting for a living, what we tell a coworker who wants to write a novel, or even the cautionary tale we tell our children when they head out into the real world. Be careful, we say ominously. Don’t be too creative. You just might starve.\nBut what we forget is that the story of the Starving Artist is a myth. And like all myths, it may be a powerful story, one we can orient our entire lives around, but in the end, it is still just a story.\nThanks to the power of this myth, many of us take the safe route in life. We become lawyers instead of actresses, bankers instead of poets, and doctors instead of painters. We hedge our bets and hide from our true calling, choosing less risky careers, because it seems easier. Nobody wants to struggle, after all, so we keep our passion a hobby and follow a predictable path toward mediocrity.\nBut what if you could make a living as an artist, and you didn’t have to starve to do it? What would that change about the way we approach our work and how we consider creativity’s importance in our world today? What would that mean for the careers we choose and the paths we encourage our kids to follow?\nIn the early Renaissance, artists did not have reputations for being diligent workers. They were considered manual laborers, receiving meager commissions for their work. Michelangelo, however, changed all that.\nAfter him, every artist began to see a “new pattern, a new way of doing things,” in the words of Bill Wallace, professor of art history at Washington University in St. Louis. Michelangelo “established the idea that an artist could become a new figure in society and have a higher social standing, and also that they could become financially successful.”\nMichelangelo did not need to starve for his creations, and neither do you. When the painter of the Sistine Chapel amassed an incredible fortune and secured his legacy as one of history’s masters, he broke the glass ceiling for future generations.\nToday, however, his contribution has been all but forgotten. We have bought into the Myth of the Starving Artist, thinking of artists as unfortunate Bohemians who struggle at the lowest end of society. This myth is hurting creative work everywhere, and it must be put to rest.\nRarely do we think of creatives as wealthy or successful, even cracking jokes about the wastefulness of art degrees and theater classes. We have heard how pursuing creativity is not a safe career bet, whether that means chasing an interest in literature, music, or some other artistic endeavor. All my life, I heard it from well-meaning teachers, friends, and relatives. The advice was always the same: Get a good degree, have something to fall back on, and don’t quit your day job.\nThe truth, though, is quite different.\nCreativity, though a nice outlet for self-expression, is not something we think a person should go “all in” on for a career. Because, odds are, you’ll starve. Right?\nSometimes, though, an artist does succeed: a singer releases a platinum record, an author hits a bestseller list, a filmmaker launches a blockbuster. We tend to dismiss these moments as rare instances of an artist getting lucky or selling out. But what if that isn’t the whole picture?\nWhen we look at many of history’s most famous artists, we see something curious. It’s the same thing we observe in the lives of countless creatives who are making a living off their art today.\nWhen we hear the cautionary tales and warnings about what it means to be an artist, there’s an important truth we must learn to embrace: You don’t have to starve.\nA new kind of artist\nIn this book, I want to offer a very simple but challenging argument: Real artists don’t starve.\nMaking a living off your creative talent has never been easier, and to show you it’s possible I will share historical examples of well-known artists, creatives, and entrepreneurs who did not have to suffer to create their best work. And I will also introduce you to a contemporary group of professionals who are experiencing surprising amounts of success in their creative work and how you can join them.\nFinally, I will try to convince you that the idea of the Starving Artist is a useless myth that holds you back more than it helps you produce your best work.\nToday, with more opportunity than ever to share our work with the world, we need a different model for creative work. The Myth of the Starving Artist has long since overstayed its welcome, and what we need now is a New Renaissance, a return to a model for art and business that doesn’t require creative workers to suffer and starve.\nWe all have creative gifts to share, and in that respect, we are all artists. The world needs your work — whether that’s an idea for a book, a vision for a startup, or a dream for your neighborhood — and you shouldn’t have to struggle to create it.\nWhat does it mean to be a “real artist”? It means you are spending your time doing the things that matter most to you. It means you don’t need someone else’s permission to create. It means you aren’t doing your work in secret, hoping someone may discover it someday. It means the world is taking your work seriously.\nDo you have to become a millionaire like Michelangelo? Not at all. This is not a book about how to get rich selling art. It is a description of the path many professional artists, creatives, and entrepreneurs have walked and one you would be wise to follow, if you want to join them.\nThe goal here is not to get rich, but to build a life that makes creating your best work not only possible but practically inevitable. And so, I think we should exchange this idea of being a Starving Artist with a new term: Thriving Artist. If you don’t want your best work to die with you, you must train yourself to think and live differently than the ways you’ve been told artists behave. You must not starve; you have to thrive.\nInspired by the Michelangelo story, I was curious to see if there were other artists out there who were succeeding. What I discovered was that a New Renaissance was not only possible, it was already happening. In my research I encountered creatives in nearly every field who weren’t starving at all.\nThe more stories I found, the more common threads began to emerge. These artists may not have known of Michelangelo’s riches, but they embodied his approach to creative work and all followed a similar set of strategies I’ve now captured and distilled in this book.\nHere they are, the principles every Thriving Artist lives by — the Rules of the New Renaissance:\nThe Starving Artist believes you must be born an artist. The Thriving Artist knows you become one.\nThe Starving Artist strives to be original. The Thriving Artist steals from his influences.\nThe Starving Artist believes he has enough talent. The Thriving Artist apprentices under a master.\nThe Starving Artist is stubborn about everything. The Thriving Artist is stubborn on vision but flexible on details.\nThe Starving Artist waits to be noticed. The Thriving Artist cultivates patrons.\nThe Starving Artist needs no one. The Thriving Artist finds a scene.\nThe Starving Artist always works alone. The Thriving Artist collaborates with others.\nThe Starving Artist does his work in private. The Thriving Artist practices in public.\nThe Starving Artist works for free. The Thriving Artist always works for something.\nThe Starving Artist sells out too soon. The Thriving Artist owns as much of his work as possible.\nThe Starving Artist does one thing. The Thriving Artist does many things.\nThe Starving Artist despises the need for money. The Thriving Artist makes money to make more art.\nFor the rest of this book, we will explore these rules in the con- text of three major themes: mind-set, market, and money.\nIn each part, we will be taking a significant step that will us shift from Starving Artists to Thriving Artists.",
      "date": "Fri Nov 17 2017",
      "id": "cY4g8qE"
    },
    {
      "title": "On Being an “Idea Person”",
      "author": "jatin",
      "logo": "https://cdn-images-1.medium.com/max/1200/1*vgzmVVN9MoNJN34jWKrWtg.jpeg",
      "category": "Creativity",
      "content": "I’m an amateur student of language, so I often pick apart things that other people say, looking for the deeper, more literal meaning behind them in an ongoing attempt to make my communication more precise.\nThe particular phrase I’m picking apart today is “I’m an idea person.”\nI used to say that a lot. I would feel as if I had all the right ideas, and if only someone would talk to me about my ideas and simply trust they were right, I could save them lots of time, money, effort, and heartache. My understanding was that the person I could help just lacked not the intelligence, but the time to have read what I have read, to have experienced what I’ve experienced.\nFunny thing was, I’d had this conversation a few years back with Clark Sell, Counselor-in-Chief of That Conference, and it has stuck with me.\n“KPD,” he said, “By now you should realize that ideas are cheap. Everyone has ideas, but it’s the few who can act on those ideas and deliver value that are our inspiration, the ones we truly want to be.” Okay, so that’s not an actual quote. The actual quote probably had a reference to smoked meat or classic car restoration in there somewhere, but you get the point.\nThere’s a lot of value here, so let’s pick apart this paraphrased quote.\nIdeas Are Cheap\nNowhere has this concept been captured better in popular culture than on Comedy Central’s South Park. In the episode “Simpsons Already Did It”, Butters schemes to take over the world, but each time he does so, he realizes that the idea was already used on Fox’s The Simpsons. The core concept is that all the great ideas have already been born, and that what changes is the craftsman wielding the idea.\nThis notion stands athwart Stephen King’s aphorism “It is the tale, not he who tells it.” I’d argue against my all-time favorite author on this one. He is the best example of it being the storyteller, not the story. His stories are often typical horror tropes — the haunted hotel, the possessed car, the killer clown, the rabid dog, the Armageddon virus — but they are told masterfully in a way that is his own, and that people respond to. You don’t have a career like that if you’re not adding something special to the well-worn ideas.\nSo if all you have is ideas, at best you have an upgrade to an old idea. This can be a good thing, but it is only a start.\nEveryone Has Ideas\nIdeas are so cheap that everyone has them. We have them all the time. We have them every time we try to think of something better than what is. The person that got sick of vacuuming and came up with the Roomba was solving a problem. But do you think that was the first person that ever had the idea of a robotic vacuum? Hardly! (I’d argue even Rosie, the Jetson’s robot maid, was not the first idea of having your housework done for you.)\nSo if everyone has ideas, what does being “an idea person” mean? Aren’t we all “idea people”?\nOnly Ideas in Action Matter\nHave you ever been in a group of people talking about something and someone says to you or someone else “Well, there’s your million dollar idea”? This happens to me every once in a while. But we all know what that means. It does not mean that you could walk up to a CEO somewhere and tell him of your idea and he’d write you a check for a million dollars. What it means is that if you quit your job, devoted all your time to producing and marketing this particular idea, that you’d have found a niche that might earn you a great deal of money, because it solves a problem for a lot of people.\nIt is only through the materialization of the idea that the idea is valuable. Many of us know Brandon Satrom from his time as a Developer Evangelist for Microsoft, or as a Product Lead at Telerik, or even through his association with That Conference. Most recently, however, he has taken his idea of creating an electronics kit for kids and a companion storybook to get them engaged all the way through a successful KickStarter. The idea isn’t the thing that made it successful. He did his research, produced a fantastic work, evangelized the project through social media, and made his funding goals (note, I do believe pre-orders are available).\n“It’s the few who can act on those ideas and deliver value that are our inspiration, the ones we truly want to be.” — Clark Sell, who along with a team of tireless volunteers, delivers That Conference annually to the community.",
      "date": "Fri Nov 17 2017",
      "id": "YHfMDBu"
    },
    {
      "title": "Thoughts And Prayers Are Meaningless Without Action",
      "author": "jatin",
      "logo": "https://cdn-images-1.medium.com/max/1200/1*6qAJi-0ULLaKiNFSMn8GuA.jpeg",
      "category": "Politics",
      "content": "Sunday, November 5th at 11:20 a.m., a deranged white man donning all black, a ballistic vest, and an assault rifle casually walked into the First Baptist Church in small town Sutherland Springs, TX. There, he opened fire on the unsuspecting congregation as they were waiting for the Sunday sermon to begin. Devin Kelley managed to kill 26 people between the ages of 5 and 72, and he injured 20 more. With this act of domestic terrorism, we now have the largest mass shooting in the history of both the state of Texas, and in a place of worship.\nAs details emerged throughout the day on Monday Nov. 6th, we learned that Kelley was 26 and twice married. Though a motive wasn’t yet named for his actions at that time, Kelley reportedly had a domestic situation with his mother-in-law, a member of First Baptist Church. He had previously served in the air force before being court-martialed in 2012 on one count of assaulting his wife, and another count of assault on their young child.\nTwo years later he was dishonorably discharged with 12 months confinement, and a reduction in rank. He allegedly tried to get a gun license in Texas but was denied. Still, he was able to obtain a Ruger AR assault-type rifle, and a week before the massacre, he posted a picture of an apparent AR-15 style semi-automatic weapon on Facebook along with the caption: “she’s a bad b*tch.”\n\nDevin Kelley’s Oct. 29th public Facebook post, courtesy Facebook, via The Independent\nIn the aftermath of this horrific event, in his usual manner, the President issued a few apathetic stock phrases at a press conference. Reading from a script, he referenced how Americans “join hands & lock arms” in the face of tragedy, and he offered his (and America’s) “thoughts and prayers.” Seemingly, an attempt to build social cohesion, but on the delivery Trump failed to invoke any emotion whatsoever. Not that anything is wrong with “thoughts and prayers” — it’s a phrase many of us use when there simply is nothing good to say — but coming from Trump, who cannot trust himself to take his eyes off-script for even just those three words, it feels incredibly disingenuous.\nNot to mention, at a time like this, thoughts and prayers alone can no longer suffice. Any self-professed Christian should understand this. Jesus himself said that we are not to offer prayers alone at the expense of doing something practical (“In the same way, faith by itself, if it is not accompanied by action, is dead.” — James 2:17). Throughout the New Testament of the Bible, Jesus’ life included a healthy balance of both prayer and action.\nWhen Jesus encountered the adulterous woman who was facing not only public humiliation but also a torturous death by stoning, he didn’t merely offer his “thoughts and prayers” and then head on down the road. He stayed with her. He got down on the ground, drew a line in the sand, and called for the one without sin to cast the first stone. What do we do to protect people? Thoughts and prayers are a start in the healing process, but they need to be accompanied by action. (Preferably, action in the way of informed, local voting. We simply need to show up.)\n",
      "date": "Fri Nov 17 2017",
      "id": "28SYQ3z"
    },
    {
      "title": "8 Proven Performance Practices from Billionaires and Elite A",
      "author": "jatin",
      "logo": "https://cdn-images-1.medium.com/max/1500/1*vbtvoE13_tDyjnagCr-7fA.jpeg",
      "category": "Entrepreneurship",
      "content": "Average is over.\nThe middle-ground has all but dissolved, leaving you in one of two positions:among the leading few or mediocre many.\nYour relationship with technology will either facilitate unthinkable opportunity and growth or keep you on the wrong side of average. As Cal Newport has said in his book, Deep Work: Rules for Focused Success in a Distracted World:\n“The ability to perform deep work is becoming increasingly rare at exactly the same time it is becoming increasingly valuable in our economy. As a consequence, the few who cultivate this skill, and then make it the core of their working life, will thrive.”\nSuccess has never been so attainable, thus making many of us spoiled and lazy. But the following eight strategies are intended to shake up your approach, challenging you to work and live at a higher and more conscious level.\nHere we go:\n1. Don’t Be Afraid Of Making An “Ugly” Move\nUntil recent history, certain chess strategies were unquestioned dogma among the world’s elite. They were written in books and taught to all next generation. This creates what psychologists call, “The Pygmalion Effect,” and it can truly limit your growth. It’s why the next generation often gets stuck with the same limiting mindsets and expectations as their predecessors.\nNot surprisingly, the validity of these “strategies” have come into question as computers have been programmed to consistently beat top players. While analyzing the computer’s strategy, players have been shocked and amused by the computer’s use of certain “ugly” moves — which no trained chess player would ever do — that utterly clash with conventional wisdom.\nRather than finesse and aesthetics guiding their strategy, the computer’s brute calculations allow it to examine every position concretely. In response to the surprising insights learned from computers, chess players have been forced to question their long-held assumptions.\nAs Magnus Carlsen, the World Chess Champion, explained in an interview with Business Insider:\n“You cannot rely on what has been taught in books — that this is good, this is bad — there are always exceptions and every situation is different.\nEven if something looks bad, it doesn’t look right, you calculate it, it works and… there you go! It’s just forcing us to look a bit further, to look away from what the books used to teach us. It’s forcing us to break the rules.”\nNo matter what field you are in, there are rigid norms guiding your thinking — the rules considered “best practice.” However, life (and chess) is messy and complex, and every situation calls for a more contextual analysis.\nWhat is right in your situation may not be right in mine.\nFor example, it makes little sense to most people why I’m getting a PhD. Many would consider it an “ugly” move. And perhaps, to most people pursuing my aims, it is an ugly move. But given my situation and personal calculations, it’s a strong strategic decision.\nThere are always exceptions.\nAnd rather than obsessing how your decisions are perceived, make the best possible decisions you can — whether standard or anomaly. Your calculations are solid, and like the computers in chess, you’ll be able to “connect the dots looking backwards.” What may look ugly to others in the moment will be your victory in the end.\n2. Realize That You’re Not “Way” Behind\nIn sports and all other forms of competition, people perform best when the game is close. Which is why big magic happens at the end of games, like on-sides kicks retrieved followed by 30 second touchdown drives. But when the contest is decidedly in one opponent’s favor, neither side acts with the same effort.\nWhen you’re winning big, it’s easy to get lax and overconfident. When you’re losing big, it’s easy to give up.\nSadly, you probably perceive those at the top of your field “in a different league” altogether. But when you do this, you perform with less intensity than you would if you perceived the “game” to be closer.\nWhen you elevate your thinking — and see yourself on the same level as those at “the top” — you quickly become disillusioned by the fallibility of those you once perceived as immortal. They are just people. Most importantly, you will begin playing with an urgency that often surpasses even them.\nThe game is close. The game is close.\n3. Do More With Less\nWe have all become addicted to input. As a culture, we’ve developed cognitive dependencies in order to sustain even lackluster performance.\nFor example, although people think they perform better on caffeine, the truth is, they really don’t. We use it to merely get back to our status-quo. When we’re off it, we under-perform and become incapable.\nA Kickstarter campaign — a rug alarm-clock that literally makes you get out of bed and stand on it to disarm it — is another example. Although clever and funny, I personally would not want to depend on a rug to get me out of bed.Our culture’s obsession with extrinsic behavioral conditions reflects a fundamental lack of intrinsic motivation.\nWe can move beyond the dependencies of constant training, spiritual assurances, and external reinforcements. We can learn to be agents that act rather than objects that are acted upon.\nWe shouldn’t need the best software to start a business, or the best guitar to play guitar. As Jason Fried and DHH have said in Rework:\n“Guitar gurus say, “Tone is in your fingers.” You can buy the same guitar, effects pedals, and amplifier that Eddie Van Halen uses. But when you play that rig, it’s still going to sound like you.\nLikewise, Eddie could plug into a crappy Strat/Pignose setup at a pawn shop, and you’d still be able to recognize that it’s Eddie Van Halen playing. Fancy gear can help, but the truth is your tone comes from you.\nMany amateur golfers think they need expensive clubs. But it’s the swing that matters, not the club. Give Tiger Woods a set of cheap clubs and he’ll still destroy you.”\nDetach yourself from your dependencies. Try going running without all the running gear. Try waking up without a Ruggie. Try living a day without caffeine. Try outputting without having to “inspire” yourself.\nDo more with less.\n4. Increase Your Responsibility\nUncle Ben once told Peter Parker, “With great power comes great responsibility.” Unfortunately, he had it backwards.\nThe constraints of responsibility force you to think more creatively. Responsibility qualifies you to show up at a higher level. I never thought parenting three foster children would increase my productivity, but it has.Failure on my part doesn’t impact only me anymore.\nAs Dan Sullivan has said, “We are at our most alert when we are in danger of failing. The greatest growth comes from being alert, scared, and striving.”\nSimilarly, chess players are at their toughest when it matters most, when everything is on the line. If you must perform to provide for your family, you’ll get it done. If it’s a matter of life or death, you’ll do whatever it takes. If your vision is compelling enough, you’ll avoid distractions.\nAlthough most people avoid limitation and constraints, they end up being the very thing needed to get a breakthrough. Said Frank Lloyd Wright, famed American architect, “The human race built most nobly when limitations were greatest, and therefore where most was required of imagination in order to build it all. Limitations seem to have always been the best friends of architecture.”\n5. Every Billionaire’s Secret: Build a Team Around You Sooner than You Feel Comfortable\n“The bigger your dream, the more important your team.” — Robin Sharma\nAccording to Alex Charfen, CEO of Charfen consulting services and founder of the Entrepreneurial Personality Type™ (EPT), the one thing billionaires have in common is that they are comfortable.\nAnd by comfortable, he doesn’t mean they wear comfy slippers — he means they barely lift a finger except when they’re doing what they do best. In order to do so, they build a team around them to take care of the rest.\nWhen most people hear this, they initially think, “Of course, they are billionaires.” However, the truth is that this is why they are billionaires.\nWhen Charfen was in his 20’s, he was at a friend’s (a billionaire) and was surprised to see a staff of two people working at his house, and a team of 30 people, including a driver. Charfen couldn’t help but ask his friend:\n“Is it ever embarrassing to have so much help and so much fuss as you go through the day and get around? I mean at least 10 people have helped us so far and it’s only 11 A.M.”\nHis friend responded:\n“It would be irresponsible for me to do anything that you observed any member of my team doing today. They are there for me and I am there for them. We have grown together and we built everything together.\nIf I had done anything that one of my team members had done today they would’ve been uncomfortable and worried. Each one of them is here for a reason and many of them played a role in training and hiring each other. They know that the more they help me get accomplished, the more secure we all are and the more we can grow our foundation.”\nHigh performers build a team around them much sooner than they are comfortable with. They are willing to think big, take on greater responsibility, and focus in on their superpower. The sooner you can remove all of the personal pressure and noise the faster your income will skyrocket.\nFor most people, the idea of “outsourcing” or hiring is intimidating. The solo-preneur has become very popular. But you can get so much more done when you let others do the logistical and mundane daily tasks. The more time you can free up to think and create and connect, the further you’ll go. Plus, it feels absolutely amazing having work done for you that used to take you hours to do yourself.\nYou’ve heard this message over and over — remove yourself from the equation except for your superpower. There are many people out there who will work for you. Many of them are more talented than you. Let go of your ego. Give the control to other people and watch as they build your vision better than you ever could.\n6. How Much Are You Willing To Put On The Line?\nElon Musk is considered eccentric in many ways. One of which is how uncomfortably long-term his thinking is. The man is trying to change the world and populate Mars. He’s willing to make any sacrifice — no matter how difficult — today, to manifest his worldview in the long-awaited future.\nMusk sunk all of his own money into his companies. Most of his decisions make little sense to other people. He’d rather wait to have his company go public if going public means stalling or misdirecting his mission to populate Mars.\nBut he’s calculating. He’s willing to make ugly moves because he is not flinching on his long-term vision. Dramatic risks accompany everything Musk does.\nHis propensity for risk does not come from insanity. But rather, from a level of conviction so intense as to be off-putting to some. When asked, “How much are you willing to put on the line?” he responded:\n“Everything that other people hold dear. I would like to die on Mars. Just not on impact. Ideally, I’d like to go for a visit, come back, and then go there when I’m like 70 or something and just stay there. If things go well, that would be the case.If my wife and I have a bunch of kids, she would probably stay with them on Earth.”\n7. Short-Term & Low Cost Experiments\nTim Ferriss doesn’t do what he thinks will make him happy. He does what excites him.\nAlthough his overarching vision remains consistent, Ferriss doesn’t have long-term plans. Instead, he does 3–6 month “experiments,” which he puts all of his energy into. He has no clue what doors may open as a result of these experiments, so why make long-term plans? He’d rather respond to the brilliant and best opportunities that arise, taking him in now unforeseen directions.\nExperiments are a fun way to pursue goals because they allow you to getinnovative and bold. Experiments are short-term — and thus relatively low risk — thus, they should be “moon shots.”\nWhy play small? What’s the worst that could happen, you waste a few months and learn a lot while doing it?\nIf you haven’t tried this idea, I challenge you to truly reconsider your approach. Try even a 2 week experiment. What’s something you’ve wanted to do? Break it down into something you can sustainably do for the next 2 weeks. Set a clear goal. Clear you schedule and priorities to make it happen.Have fun with it. Be bold.\nWho cares what people think about you?\nThe people from your high school don’t matter.\nThe people who truly do matter in your life will support you.\nSo start.\nStart.",
      "date": "Fri Nov 17 2017",
      "id": "HPny9ZS"
    },
    {
      "title": "Marketing Is Not About Your Company’s Values",
      "author": "jatin",
      "logo": "https://cdn-images-1.medium.com/max/1500/1*rJFmjItseRF15QtK7EIc0Q.png",
      "category": "Entrepreneurship",
      "content": "Marketing is really about how customer values translate into aspirations, insecurities, fears and motivations.\nTwenty years ago, in 1997, Steve Jobs told us,\n“Marketing is about values”\nHe was right, of course. He was right about a lot of things, and marketing in particular was where he ruled. He was right in that the way to talk about a brand is “not to talk about speeds and fees” or “bits and mega-hertz” or “why we are better than windows.” He was right that marketing is about benefits, not features. And he was right when he said,\n“Our customers want to know who is Apple and what is it that we stand for?”\nAll true.\nBut what he didn’t explicitly say is that customers only want to know “what a company stands for” as it relates back to them.\nMarketing, at the end of the day, is not just about a company’s values — it’s about understanding what these mean to a customer, and getting that meaning to be felt strongly enough that they buy.\nNow, the real mastery of Jobs is that he almost certainly knew this, consciously or subconsciously. He almost certainly knew full well that people care more about themselves than Apple — and he also almost certainly knew full well that that speech he gave was not talking about marketing. It was marketing.\nWhich is why he said things like:\n“Apple at the core — it’s core value — is that we believe that people with passion can change the world for the better.”\nAnd,\n“The people who believe they can change the world are the ones who do.”\nWhen he said this, he almost certainly knew:\nHe wasn’t talking about Apple. And he wasn’t even talking about the customers.\nHe was talking to them.\nPeople don’t care about you — people care about themselves\nAnd they care about you only to the extent that you fulfill their wants and needs.\nLook, it’s not cynical — it’s a fact. People not do business with you as an act of charity, or to get in on some of that sweet, sweet value set you got going on. They do business with you because they believe you are adding value to their lives — and how that sweet value set of yours aligns with their own.\nPeople don’t come into the whiskey bar just because it’s cool — they come in because they want to feel cool. They don’t drink whiskey just because it’s “manly” or “strong” — they drink it so they feel manly and strong.\nPeople didn’t buy Apple because they liked that Apple “believed people with passion can change the world” (like “oh, now isn’t that nice!”) No. People bought Apple because they wanted to see themselves as one of those people.\nAnd the success of a business — and its marketing message — is partially figuring out what people want. And partially the promise of fulfilling it.\nPeople care about the way you make them feel\nThere are a number of companies popping up that sell clothing with elephants on it and donate part of the proceeds to “saving the elephants.”\nThey’re popular. And they’re popular not because donating makes people feel good, but because elephants make people feel good.\nIt’s not accidental. These companies aren’t donating to, say, endangered Amazonian spiders or rock moss.\nNo. It’s elephants.\nWhy? It’s simple. You want to sell some fast-fashion casual clothing? Look at who’s buying it. Once you know who’s buying it (and we all know who it is: early 20’s to early 30’s women), then look at why they’re buying it — their values, their insecurities, their wants and aspirations and motivations.",
      "date": "Fri Nov 17 2017",
      "id": "xeh331J"
    },
    {
      "title": "Why Aren’t Foundations Actually Helping Their Grantees Like ",
      "author": "shagun",
      "logo": "https://cdn-images-1.medium.com/max/2000/1*N-SQXSMJHCZzC7JNUOBxSg.png",
      "category": "Technology",
      "content": "I was recently interviewed by a collaborating team from three high profile foundations/LLCs. Their primary question: “How do we find and cultivate more breakthrough ideas in education?”\nThis question feels all too familiar from foundations today: a primary focus on ideas and issues, often at the expense of talent support and operational excellence. Grand challenges, RFP’s, and funder-borne calls to serve homegrown theories of change have established an unproductive power dynamic that stunts creative problem solving with grantees, inadvertently (and almost passive-aggressively) steering their efforts. Reporting requirements and restrictions with how dollars are to be used can be distracting, and even crippling.\nGrantees are treated as functional subcontractors for a foundation’s vision. Visionary grantees? That often feels like an unsupported category in this new world.\nWhat I’ve learned and relearned since returning stateside six years ago with stints at IDEO, Medium, and now Obvious Ventures is nothing new: ideas are cheap. Execution is where the game is played, and talented, passionate teams that are well-supported play it best — delivering the greatest impact, no matter the sector. Foundations should be bending over backwards to support their grantees’ vision and their execution, yet this is rarely the case today.\nHow might foundations better find and cultivate — or dare I say, invest in — the people to deliver this impact? While Skoll (community building), Omidyar (promoting open roles at grantee orgs), DRK (board seats), and Arbor Brothers have all been attempting some versions of this, a truly value-add, organizationally-supportive funder has yet to emerge.\nLooking to venture capital’s most prolific firms, notably those considered “founder-friendly” with strong portfolio services models, might be instructive here.\nA Shared Lineage, Converging: Adventure Capital & The Gospel of Wealth\nModern philanthropy and private equity have the same parents: the Wallenbergs, Vanderbilts, Whitneys, Rockefellers, and Warburgs. In 1946 John Hay Whitney and Benno Schmidt started J.H. Whitney & Company, initially positioning itself as “a lender of ‘private adventure capital’” — and legend has it, Schmidt abbreviated this to “venture capital” so it would roll off the tongue more easily.\nWhile Andrew Carnegie wrote The Gospel of Wealth in 1889, the rise of modern philanthropy in the early-to-mid 20th century mirrored that of venture capital: families of extraordinary wealth seeking new and novel opportunities to deploy that capital to deliver social and financial return. For the latter, one question suffices to determine its success: did the investment make money, and at what multiple?\nWithin the social sector, the motives and expected returns are multifaceted:\nA robust [philanthropic and nonprofit] sector can decentralize the production of public goods, so that the government does not solely decide how to spend tax dollars. It can support those institutions in civil society that mediate between individuals and the state. And it can produce public goods that are more sensitive to local demand and delivered with greater efficiency than would governmental institutions. Yet a primary motivation for charity has always been to provide for the poor and disadvantaged, and to attack the root causes of poverty and disadvantage. [Reich, A Failure of Philanthropy. SSIR, 2005.]\nThe landscape has become even more dynamic today. The emergence of social enterprise, alternative investment options for foundations, and LLC-based impact outfits have muddied the waters for how to best achieve desired social outcomes — in a good way. We are seeing a wider mix of organizations, including social enterprises, supporting the “institutions in civil society that mediate between individuals and the state” which Reich refers to above, largely due to (1) consumers rewarding social and environmentally responsible businesses, and (2) the failure of federal policymakers to make headway on legislative issues.\nStrategy: Industry Disruptors > Industries to Disrupt\nOne view is that foundations and LLCs are now providers of innovation risk capital to nonprofits, social entrepreneurs, and for-profit businesses. These funders are increasingly investing seed capital in similar ways — and often, in the same companies — as venture capitalists, without the pressure of financial return. Recent examples in education alone include Newsela, LearnZillion, and DreamBox Learning — all initially foundation-funded, and subsequently backed by blue chip venture investors.\nThose that get the follow-on venture funding also receive ongoing, operational support from venture firms: recruiting help, marketing and management know-how, and most importantly tapping the venture firm’s deep network.\nBut what about those that aren’t for-profit businesses, i.e. the overwhelming majority of grantees? As they grow, shouldn’t they too have access to value-add resources? If the lines between a social enterprise and a revenue-generating nonprofit are blurring, shouldn’t foundations also aim to ensure their capital is deployed with impact in the same ways venture firms work to ensure their capital’s financial return via operational support?\nWhy do the funders’ approaches differ so radically?\nThere are obvious reasons. Startups typically aim for liquidity events (acquisition or IPO), while nonprofits don’t look for exits. Venture investors will help portfolio companies any way they can and often take action when the company is veering off-course, while program officers tend to steer clear of such practices for fear of undue influence. For-profit boards include investors, while non-profit boards rarely include funders.\nThere are some not-so-obvious reasons as well. VCs don’t invest in industries to disrupt — they invest in industry disruptors, with high levels of risk and a portfolio approach which, over time, favors more successful investments. Foundations on the other hand tend to treat the majority of grantees similarly (outside a binary yes/no on grant extension) despite their promise or lack thereof.\nI find these reasons insufficient to explain the experimentation gap by foundations in how they support grantees, and how they structure themselves to do so.\nOrg Shift: What a Grantee-Friendly Foundation Could Look Like\nBack to that question at the top: “How do we find and cultivate more breakthrough ideas in education?” I suggest that is precisely the wrong question.\nFoundations might consider building teams that can ask and answer this reframed question instead: “How might we find and invest in world class teams to create meaningful, sustained in economic mobility among the bottom 50 percent?”\nSo what might that team, organization structure, and process look like?\nI. Operators as Grantmakers\nJust as the venture community now deploys former operators as investors (as opposed to investment professionals exclusively), so too should foundations consider hiring more world-class operators as grantmaking leaders. (It’s worth acknowledging that foundations sometimes hire operators, but rarely deploy them in ways that support grantees. Putting them in a position to do so is outlined in #2 below).\nMany of the top venture firms now count operators as leaders: Ben Horowitz and Marc Andreessen, Sarah Tavel (early at Pinterest, now a partner at Benchmark), and Josh Elman (worked in product management at LinkedIn, Facebook, and Twitter — now a partner at Greylock) to name a few. Partners at my firm, Obvious Ventures, have experience founding, funding, or operating companies like Patagonia, Plum Organics, and Seventh Generation.\nWhat if you could have Jessica Jackley (Kiva) or Charles Best (Donorschoose) leading your grantmaking? How might their perspective on what it takes to build a successful, impactful organizations change whom they give money to and what the grant structure looks like? Seems like they might know a thing or two about building and running a highly functional, impactful organization.\nII. Specialized Support Teams\nThis is related but distinct, and even more critical. The extreme within venture capital is Andreessen Horowitz, having built a team of 100+ across categories including executive recruiting, technology recruiting, marketing, market/business development, corporate development, and operations.\nWhat if you could have Matt Wahl, who spent five years at Khan Academy leading product, helping your grantees with their mobile strategy? Or Tyler Riewer of charity: water working with them on storytelling and marketing? If I were building a support team for grantees I’d want them on my team.\nCurrently many foundations simply outsource this by funding nonprofits to hire consultants of all varieties. There are ways to respect nonprofit leaders’ independence while delivering real value, especially when grantmakers and grantees have trusting relationships and grantees aren’t living paycheck-to-paycheck. Which brings us to the last point.\nIII. Policy Refreshes: Pro Rata, Board Seats, Exits, and Extended Runway\nWhile the field of venture philanthropy has explored elements of this, there remains much to be desired. Might foundations consider committing to funding a percentage of an organization’s budget in success or subsequent fundraises, as venture capitalists stake out pro rata rights in future rounds? Wouldn’t that be an extraordinary vote of confidence in the grantees and enable breathing room, potentially impacting outcomes?\nShould program officers and foundation trustees consider taking board seats, increasing their commitment to an organization?\nCould foundations consider taking more of a portfolio approach, acknowledging that (and we all know this already) many of their grants simply won’t have the impact they hope? This would allow them to more realistically make bets while serving as a forcing function to failing organizations, and even drive constructive M&A activity in the sector — something much discussed and sorely needed given the sheer number of redundancies. Funders can and should use their leverage to move more nonprofits toward mergers.\nIn some ways, it’s the nonprofits that might be forcing the conversation with foundations. Nancy Lublin, one of the most successful nonprofit leaders and operators today (Dress For Success, DoSomething.org), decided to raise a round for Crisis Text Line like a tech startup would — her most recent one coming in at $25.5M, giving her runway for years. While this is the extreme, it is illustrative nonetheless.\nImagine what others could do if they had access to unrestricted funds for longer periods of time, strong operational resources, and a board made up of those funders with skin in the game.\nIt’s worth noting that The Bridgespan Group’s Michael Etzel and Ford’s Hilary Pennington effectively articulate the broader challenge of program-driven funding models, and the call for foundations to back foundational capability building. Darren Walker’s leadership here has also been met with much fanfare, yet it remains unclear how this is being operationalized within the Ford Foundation, specifically with staff makeup and organization structure.\nIt seems there’s much left to be explored on what it really means to support nonprofit and other mission-driven grantee organizations.\nLimitations (But Not Excuses)\nThere are numerous limitations to this analogy, especially funders not wanting to inappropriately influence grantees’ activity, preferring a more hands-off approach.\nBut aiming for the “success” of each grant may be impeding foundations from their and our collective goals: progress on our most pressing social and environmental challenges. Perhaps it’s time to reflect on their own organizations in service thereof.",
      "date": "Fri Nov 17 2017",
      "id": "NnIZIdW"
    },
    {
      "title": "Losing Louis",
      "author": "shagun",
      "logo": "https://cdn-images-1.medium.com/max/1200/1*s2-aEatYZjn_VtHysHbV2g.jpeg",
      "category": "Politics",
      "content": "At the beginning of the year, I sat on the edge of my nosebleed seat in Portland’s crowded Moda Center as Louis C.K. took the stage to thunderous applause.\nAs he performed, dressed in a suit rather than his classic t-shirt and jeans, I laughed harder than I have in my life. When I stood up for his standing ovation, I honest-to-God teared up a little bit because I couldn’t believe it — he was here! He was a real, live person, performing for me! And also for hundreds of others, yes, but also for me! The elation lasted throughout the night, long after I had driven home. I felt giddy in the way that only your favorite artists can make you feel.\nIn my memory, the happiness of that night is still intact, but reliving it today feels distinctly wrong. Yesterday, The New York Times published a disturbing (and impeccably reported) story detailing allegations of sexual harassment against Louis. First and foremost, I felt horror and sadness for the women who had been hurt and kept quiet for so long. But lingering below the surface, I felt stinging betrayal, upset that a man I’d pegged as a Good Guy had done repulsive things.\nAs the entertainment industry is turned upside down by dozens of women coming forward with allegations of sexual harassment and assault against powerful men, the news of Louis’s misconduct feels different. Perhaps it is because I didn’t know who Harvey Weinstein was until his scandal broke, and I only vaguely recognized Kevin Spacey from American Beauty. In my mind, I swiftly condemned both men and their alleged actions, and I only felt sympathy and sadness for all of the victims who were sharing their stories.\nBut losing Louis feels different, more intimate. Losing him feels like losing a father.\nI found that I related Louis in ways I couldn’t with other male writers I admired. We both have Mexican fathers, but we look white. Our dads were distant, and our mothers worked hard taking care of us alone. He seemed to be raising his daughters in the way I wished I was raised by my dad, the way I hope to raise my kids.\nI was fascinated by the way he talked about ethics, sex, education, and parenting. I loved the way he said what he thought in the most truthful way, vulgarity and all. I loved the way he approached his work, and I loved the way in which he viewed the world, somehow both nihilistic and hopeful. He thought people should be grateful for the things they have, and that they shouldn’t hit their kids, and that people were not always as good as they seemed to be but had the capacity to be better.\nSometimes during his set he would make himself break, laughing as he said something that would horrify his audience and delight himself. That laugh was one of my favorite sounds.\nIn short, I adored Louis and his work, much in the way his character in I Love You, Daddy reveres John Malkovich. My consumption of his material occurred in a bubble, and I wasn’t aware until the Times story broke that he faced sexual misconduct allegations. Last night, I read the article on my phone three times through while riding the train. I didn’t feel surprise or shock; I felt sick.\nAs a young female writer, I viewed him as I’m sure his daughters do — as a fatherly figure inspiring me to challenge myself and my beliefs. After reading the Times story, I instead saw myself in the place of every one of those women, some of whom were in their early twenties (like me) and at the start of their careers (like me). That’s how he saw young women, I thought to myself. And that’s how he would treat someone like me.\nSince reading the Times story, I have been consuming every reporter and media critic’s opinion on how to deal with Louis and his work in light of these allegations. Can we separate “the art from the artist,” and view his past work without being complicit in the pain he caused? If not, can he ever be redeemed in the industry, as it seems that other controversial stars like Mel Gibson have been?\nI am 23 years old, and a big part of being a 23-year-old is feeling like I don’t know enough about anything to have an opinion. So I read the opinions of others who do know enough to have an opinion and settle on the ones that ring true. So while I don’t know how to answer any of those questions, I can say for sure that there’s no way I can watch his set, or hear his laugh, without thinking of the shame and horror those women carried around for years.\nYesterday, I lost one of my heroes, which seems to happen all too often as one gets older. But I felt some hope, as the onslaught of allegations coming to light could finally lead to a culture of accountability in which powerful men cannot abuse others. I also felt a rush of gratitude for the brave women who have been coming forward in order to make that change possible.\nThis afternoon, Louis released a statement confirming the allegations and apologizing for the pain he caused the five women who came forward. He wrote, “I have spent my long and lucky career talking and saying anything I want. I will now step back and take a long time to listen.”",
      "date": "Fri Nov 17 2017",
      "id": "sYajBb9"
    }
  ],
  "users": [
    {
      "id": "jatin",
      "password": "123",
      "favourite": [
        "KmuupPx",
        "KnizxN8"
      ],
      "my_blog": [
        "KmuupPx",
        "dXogrnK",
        "cY4g8qE",
        "YHfMDBu",
        "28SYQ3z",
        "HPny9ZS",
        "xeh331J"
      ]
    },
    {
      "id": "shagun",
      "password": "123",
      "favourite": [
        "KnizxN8"
      ],
      "my_blog": [
        "NnIZIdW",
        "sYajBb9"
      ]
    }
  ]
}
